#include <stdio.h>

int main(){
    char menu[3][4][20]={
        {"우유","커피","주스","탄산음료"},
        {"칸칩","거북칩","감자칩","고구마칩"},
        {"안타볼","초코버섯","가재깡","씨리얼"}
        };
    int input;

    while(1){
        printf("전체 상품 목록입니다.");
        printf("========================================\n");
        printf("1. 우유    2.커피    3.주스    4.탄산음료\n5.칸칩    6.거북칩   7.감자칩   8.고구마칩\n9.안타볼   10.초코버섯  11.가재깡  12.씨리얼\n");
        printf("========================================\n");

        printf("몇번 상품을 구매하시겠습니까?(1~12)");
        scanf("%d", &input);

        if(1<=input && input<=12)
            printf("구매하신 상품은 %d.%s입니다. \n이용해주셔서 감사합니다.\n\n\n",input, menu[(input/4)][input%4-1]);
        else{
            printf("번호를 잘못 입력했습니다. 프로그램 종료\n");
            return 0;
        }
    }
    return 0;
}